{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "NodeUpgrade",
			"Children": [
				{
					"Source":
					{
						"Text": "+{Amount}"
					},
					"Translation":
					{
						"Text": "+{Amount}"
					},
					"Key": "ui.refund_amount"
				},
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "닫기"
					},
					"Key": "ui.close"
				},
				{
					"Source":
					{
						"Text": "Cost"
					},
					"Translation":
					{
						"Text": "비용"
					},
					"Key": "ui.cost"
				},
				{
					"Source":
					{
						"Text": "Current purity"
					},
					"Translation":
					{
						"Text": "현재 순도"
					},
					"Key": "ui.current_purity"
				},
				{
					"Source":
					{
						"Text": "Downgrade"
					},
					"Translation":
					{
						"Text": "등급 낮추기"
					},
					"Key": "ui.downgrade"
				},
				{
					"Source":
					{
						"Text": "Extraction rate ×{Before} → ×{After}"
					},
					"Translation":
					{
						"Text": "채굴 속도 ×{Before} → ×{After}"
					},
					"Key": "ui.extraction_rate"
				},
				{
					"Source":
					{
						"Text": "Impure"
					},
					"Translation":
					{
						"Text": "불순"
					},
					"Key": "purity.impure"
				},
				{
					"Source":
					{
						"Text": "Missing: {Count}"
					},
					"Translation":
					{
						"Text": "부족: {Count}"
					},
					"Key": "ui.missing"
				},
				{
					"Source":
					{
						"Text": "New purity"
					},
					"Translation":
					{
						"Text": "새 순도"
					},
					"Key": "ui.new_purity"
				},
				{
					"Source":
					{
						"Text": "No valid upgrade cost is defined for this node"
					},
					"Translation":
					{
						"Text": "이 노드에는 유효한 강화 비용이 설정되어 있지 않습니다"
					},
					"Key": "err.config"
				},
				{
					"Source":
					{
						"Text": "Node downgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "노드가 {Purity}(으)로 낮아졌습니다"
					},
					"Key": "msg.downgraded"
				},
				{
					"Source":
					{
						"Text": "Node upgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "노드가 {Purity}(으)로 강화되었습니다"
					},
					"Key": "msg.upgraded"
				},
				{
					"Source":
					{
						"Text": "Normal"
					},
					"Translation":
					{
						"Text": "보통"
					},
					"Key": "purity.normal"
				},
				{
					"Source":
					{
						"Text": "Not enough inventory space for the refund"
					},
					"Translation":
					{
						"Text": "환급받을 인벤토리 공간이 부족합니다"
					},
					"Key": "err.inventory_full"
				},
				{
					"Source":
					{
						"Text": "Not enough items"
					},
					"Translation":
					{
						"Text": "아이템이 부족합니다"
					},
					"Key": "err.not_enough_items"
				},
				{
					"Source":
					{
						"Text": "Open node upgrade menu"
					},
					"Translation":
					{
						"Text": "노드 강화 메뉴 열기"
					},
					"Key": "input.open_menu"
				},
				{
					"Source":
					{
						"Text": "Opens the upgrade menu of the resource node you are looking at."
					},
					"Translation":
					{
						"Text": "바라보고 있는 자원 노드의 강화 메뉴를 엽니다."
					},
					"Key": "input.open_menu.description"
				},
				{
					"Source":
					{
						"Text": "Pure"
					},
					"Translation":
					{
						"Text": "순수"
					},
					"Key": "purity.pure"
				},
				{
					"Source":
					{
						"Text": "Refund"
					},
					"Translation":
					{
						"Text": "환급"
					},
					"Key": "ui.refund"
				},
				{
					"Source":
					{
						"Text": "Refund if downgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "{Purity}(으)로 낮출 경우 환급"
					},
					"Key": "ui.refund_header"
				},
				{
					"Source":
					{
						"Text": "Resource node upgrade"
					},
					"Translation":
					{
						"Text": "자원 노드 강화"
					},
					"Key": "ui.title"
				},
				{
					"Source":
					{
						"Text": "This node cannot be upgraded"
					},
					"Translation":
					{
						"Text": "이 노드는 강화할 수 없습니다"
					},
					"Key": "err.unsupported"
				},
				{
					"Source":
					{
						"Text": "This node cannot go below its original purity"
					},
					"Translation":
					{
						"Text": "이 노드는 원래 순도 아래로 내릴 수 없습니다"
					},
					"Key": "err.base_purity"
				},
				{
					"Source":
					{
						"Text": "This node is already at maximum purity"
					},
					"Translation":
					{
						"Text": "이 노드는 이미 최대 순도입니다"
					},
					"Key": "err.max_purity"
				},
				{
					"Source":
					{
						"Text": "Upgrade"
					},
					"Translation":
					{
						"Text": "강화"
					},
					"Key": "ui.upgrade"
				},
				{
					"Source":
					{
						"Text": "{Owned} / {Required}"
					},
					"Translation":
					{
						"Text": "{Owned} / {Required}"
					},
					"Key": "ui.amount_owned"
				}
			]
		},
		{
			"Namespace": "NodeUpgradeDebug",
			"Children": [
				{
					"Source":
					{
						"Text": ", "
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ItemSeparator"
				},
				{
					"Source":
					{
						"Text": "/nodeupgrade (alias /nu) info | setpurity <impure|normal|pure> | upgrade | downgrade | give <ItemClass> [amount] | validate | reload"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Usage"
				},
				{
					"Source":
					{
						"Text": "Aim at a resource node (or at an extractor built on it) first."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoTarget"
				},
				{
					"Source":
					{
						"Text": "No cost table loaded. Check FactoryGame.log for LogNodeUpgrade errors."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateNotLoaded"
				},
				{
					"Source":
					{
						"Text": "No extractor or generator on this node."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoNoBuilding"
				},
				{
					"Source":
					{
						"Text": "Node {Name}: {Resource} ({Class}), kind {Kind}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoNode"
				},
				{
					"Source":
					{
						"Text": "Paid for {Tier}: {Items}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoPaid"
				},
				{
					"Source":
					{
						"Text": "Purity {Purity} | original {Original} | modified by the mod: {Modified} | cost entry: {Entry}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoPurity"
				},
				{
					"Source":
					{
						"Text": "This command needs you on foot (not in a vehicle)."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoCharacter"
				},
				{
					"Source":
					{
						"Text": "costs.json reloaded: {Result}, {Entries} entries, {Errors} errors, {Warnings} warnings. Already paid refunds are unchanged."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ReloadDone"
				},
				{
					"Source":
					{
						"Text": "failed (previous table kept)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Failed"
				},
				{
					"Source":
					{
						"Text": "no"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "No"
				},
				{
					"Source":
					{
						"Text": "none"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "None"
				},
				{
					"Source":
					{
						"Text": "none"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoEntry"
				},
				{
					"Source":
					{
						"Text": "nothing"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Nothing"
				},
				{
					"Source":
					{
						"Text": "ok"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Ok"
				},
				{
					"Source":
					{
						"Text": "unknown item"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UnknownItem"
				},
				{
					"Source":
					{
						"Text": "yes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Yes"
				},
				{
					"Source":
					{
						"Text": "{Amount} x {Item}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ItemAmount"
				},
				{
					"Source":
					{
						"Text": "{Entries} entries, {Found} / {Total} item classes found, refund ratio {Ratio}. File: {Path}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateSummary"
				},
				{
					"Source":
					{
						"Text": "{Entry} / {Tier}: item class {Class} not found"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateMissing"
				},
				{
					"Source":
					{
						"Text": "{Name}: {Min} - {Max} MW"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoGeoThermal"
				},
				{
					"Source":
					{
						"Text": "{Name}: {Rate}/min, cycle {Cycle} s"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoExtractor"
				}
			]
		}
	]
}